testout.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-25 Sat 23:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>testout labsim considered harmful</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">testout labsim considered harmful</h1>
<blockquote>
<p>
"[Testout] is not a teaching instrument, it's an annoyance instrument"
&#x2013; mr hegler 
</p>
</blockquote>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. security</a>
<ul>
<li><a href="#org0000001">1.1. linux (4.4)</a></li>
<li><a href="#org0000002">1.2. NATs (5.4)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> security</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> linux (4.4)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
at least they tried. testout and cengage usually ignore the existance
of 80.7% of servers<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> and only talk about windows.
</p>
</div>

<div id="outline-container-org0000003" class="outline-4">
<h4 id="org0000003"><span class="section-number-4">1.1.1.</span> listing sockets</h4>
<div class="outline-text-4" id="text-1-1-1">
<blockquote>
<p>
Which command should you use to display both listening and
non-listening sockets on your Linux system? (Tip: enter the command as
if in Command Prompt.)
</p>

<p>
A: netstat -a
</p>
</blockquote>

<p>
<code>netstat</code> on linux (but not on openbsd) is deprecated, <code>ss</code> (which
testout already knows about, they mentioned it on the previous page)
should be used instead.
</p>
</div>
</div>

<div id="outline-container-org0000004" class="outline-4">
<h4 id="org0000004"><span class="section-number-4">1.1.2.</span> nmap tcp</h4>
<div class="outline-text-4" id="text-1-1-2">
<blockquote>
<p>
Which command should you use to scan for open TCP ports on your Linux
system? (Tip: enter the command as if in Command Prompt.)
</p>

<p>
A: nmap -sT
</p>
</blockquote>

<p>
&#x2026; have the people at testout never used <code>nmap</code> before? it defaults
to scanning TCP, even without <code>-sT</code>. 
</p>
</div>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.2.</span> NATs (5.4)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0000005" class="outline-4">
<h4 id="org0000005"><span class="section-number-4">1.2.1.</span> site-local ipv6 addresses</h4>
<div class="outline-text-4" id="text-1-2-1">
<blockquote>
<p>
IPv6 reserves all addresses beginning with a binary 1111 1110 11
(hexadecimal FEC0::/48) for private IP networks. This address range is
called the site-local address range.
</p>
</blockquote>

<p>
ipv6 site-local addresses are deprecated<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. the range is
<code>fec0::/10</code>, not <code>fec0::/48</code><sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup> (hint: if you
count how many numbers are in <code>1111 1110 11</code>, it is definitely not 48)
</p>

<pre class="example" id="org0000005">
fec0::/10 starts at fec0:: and ends at feff:ffff:ffff:ffff:ffff:ffff:ffff:ffff
fec0::/48 starts at fec0:: and ends at fec0::ffff:ffff:ffff:ffff:ffff
</pre>

<p>
that's off by a factor of 274,877,906,943!<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>
</p>
</div>
</div>

<div id="outline-container-org0000006" class="outline-4">
<h4 id="org0000006"><span class="section-number-4">1.2.2.</span> concurrent connections</h4>
<div class="outline-text-4" id="text-1-2-2">
<blockquote>
<p>
NAT supports a limit of 5,000 concurrent connections.
</p>
</blockquote>

<p>
what!? where did they get this number from?
</p>

<p>
65535 (max number of ports) would be understandable, however since a
NAT can re-use the same port number for concurrent connections for
different source+destination combinations, this would only apply to
connections from a single host going to a single host.
</p>

<p>
there would also be resource constraints due to ram, or even hard
limits on some consumer devices such as 4096, but 5000 would not make
any sense for this. 5000 is not a power of two (or a power of two
minus one), it would just be wasting resources to arbitrarily limit at
specifically 5000.
</p>

<p>
i could not find a single corroboration of this 5000 number, even when
specifically including 5000 in searches.
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara"><a href="https://w3techs.com/technologies/overview/operating_system">w3techs usage of unix-like operating systems</a>
on known webservers</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara"><a href="https://datatracker.ietf.org/doc/html/rfc3879">RFC3879</a></p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara"><a href="https://datatracker.ietf.org/doc/html/rfc3513#section-2.4">RFC3513, section 2.4</a></p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">0xff ffff ffff
minus 0xc0 0000 0000 is 0x3f ffff ffff</p></div></div>


</div>
</div></div>
</body>
</html>
